OdDeviationParams.setMaxPerCircle(System.UInt16)
\details
Sets a new maximum number of circle segments.
\param maxPerCircle [in] A new maximum quantity of circle segments to be set.

OdDeviationParams.getMaxPerCircle
\details
Retrieves the maximum number of circle segments.
\returns An unsigned 16-bit integer value that represents the current maximum quantity of circle segments.

OdDeviationParams.setMinPerCircle(System.UInt16)
\details
Sets a new minimum number of circle segments.
\param minPerCircle [in] A new minimum quantity of circle segments to be set.

OdDeviationParams.getMinPerCircle
\details
Retrieves the minimum number of circle segments.
\returns An unsigned 16-bit integer value that represents the minimum quantity of circle segments.

OdDeviationParams.setDeviation(System.Double)
\details
Sets a new deviation value for the parameters set.
\param deviation [in] A new deviation value to be set.

OdDeviationParams.getDeviation
\details
Retrieves the current deviation value.
\returns A double value that represents the current deviation value.

OdDeviationParams.#ctor(System.Double,System.UInt16,System.UInt16)
\details
Creates a new set of deviation parameters with the specified values.
\param deviation    [in] A deviation value.
\param minPerCircle [in] A minimum number of segments to divide the circle into.
\param maxPerCircle [in] A maximum number of segments to divide the circle into.

OdDeviationParams
\details
A class that implements work with geometry deviation parameters.